app/views/vagas/_form.html.erb

SELECT "apartamentos".* FROM "apartamentos" ORDER BY "apartamentos"."local" ASC
---
    <div class="col-lg-10">
      <%= f.select :apartamento_id, options_for_select(ApartamentoSingleton.instance.returnApartamentos.map{ |c| [c.local, c.id, {'local'=>c.local}] }, apartamento_id = f.object.apartamento_id) %>