app/views/vagas/index.html.erb

SELECT  "apartamentos".* FROM "apartamentos" WHERE "apartamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% @vagas.each do |vaga| %>
    <% if (Apartamento.find(current_user.apt_login_id).local == vaga.apartamento.local) or (current_user.apt_login_id == nil)%>