app/controllers/apartamentos_controller.rb

SELECT "apartamentos".* FROM "apartamentos" WHERE (local like '%D%' OR nome_proprietario like '%D%' OR cpf_proprietario like '%D%' OR nome_morador like '%D%')
---
  def index
    if params[:search]
      @apartamentos = Apartamento.search(params[:search])

INSERT INTO "apartamentos" ("local", "nome_proprietario", "nome_morador", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["local", ""], ["nome_proprietario", ""], ["nome_morador", ""], ["senha", ""], ["created_at", 2017-03-02 04:43:47 UTC], ["updated_at", 2017-03-02 04:43:47 UTC]]
INSERT INTO "boletos" ("apartamento_id", "codigo", "data_emissao", "data_vencimento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["apartamento_id", 3], ["codigo", 2023], ["data_emissao", Mon, 02 Jan 2017], ["data_vencimento", Thu, 02 Feb 2017], ["created_at", 2017-03-09 00:41:44 UTC], ["updated_at", 2017-03-09 00:41:44 UTC]]
---
  def create
    @apartamento = Apartamento.new(apartamento_params)

    respond_to do |format|
      if @apartamento.save
        d = DateTime.now.month
        for i in d..12
          boleto = Boleto.new
          boleto.apartamento_id = @apartamento.id
          if(i == 12)
            boleto.data_emissao = DateTime.new(DateTime.now.year, 12, 2, 0, 0, 0)
            boleto.data_vencimento = DateTime.new((DateTime.now.year+1), 1, 2, 0, 0, 0)
            boleto.codigo = Integer(000000+@apartamento.id+DateTime.now.year+i+(i+1)*10000000)
          else
            boleto.data_emissao = DateTime.new(DateTime.now.year, i, 2, 0, 0, 0)
            boleto.data_vencimento = DateTime.new(DateTime.now.year, (i+1), 2, 0, 0, 0)
            boleto.codigo = Integer(@apartamento.id+DateTime.now.year+i+(i+1)*10000000)
          end

          boleto.created_at = DateTime.now

UPDATE "apartamentos" SET "local" = ?, "nome_proprietario" = ?, "nome_morador" = ?, "senha" = ?, "updated_at" = ? WHERE "apartamentos"."id" = ?  [["local", "D 702"], ["nome_proprietario", "Jose"], ["nome_morador", "Jose"], ["senha", "123213"], ["updated_at", 2017-03-07 02:44:13 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @apartamento.update(apartamento_params)

DELETE FROM "apartamentos" WHERE "apartamentos"."id" = ?  [["id", 1]]
---
  def destroy
    @apartamento.destroy

SELECT  "apartamentos".* FROM "apartamentos" WHERE "apartamentos"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_apartamento
      @apartamento = Apartamento.find(params[:id])