app/controllers/boletos_controller.rb

  def index
    @boletos = Boleto.all
    @apartamento = Apartamento.all
---
SELECT "boletos".* FROM "boletos"
SELECT "apartamentos".* FROM "apartamentos"

  def show
     @apartamento = Apartamento.all
---
SELECT "apartamentos".* FROM "apartamentos"

  def new
    @boleto = Boleto.new
    @apartamento = Apartamento.all
---
SELECT "apartamentos".* FROM "apartamentos"

  def edit
    @apartamento = Apartamento.all
---
SELECT "apartamentos".* FROM "apartamentos"

  def create
    @boleto = Boleto.new(boleto_params)

    respond_to do |format|
      if @boleto.save
---
INSERT INTO "boletos" ("apartamento_id", "data_emissao", "data_vencimento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["apartamento_id", 1], ["data_emissao", Wed, 01 Mar 2017], ["data_vencimento", Wed, 01 Mar 2017], ["created_at", 2017-03-01 19:40:36 UTC], ["updated_at", 2017-03-01 19:40:36 UTC]]

  def update
    respond_to do |format|
      if @boleto.update(boleto_params)
---
UPDATE "boletos" SET "status" = ?, "data_emissao" = ?, "data_vencimento" = ?, "updated_at" = ? WHERE "boletos"."id" = ?  [["status", false], ["data_emissao", Sun, 26 Feb 2017], ["data_vencimento", Sun, 26 Feb 2017], ["updated_at", 2017-02-26 02:49:38 UTC], ["id", 1]]

  def destroy
    @boleto.destroy
---
DELETE FROM "boletos" WHERE "boletos"."id" = ?  [["id", 1]]

    def set_boleto
      @boleto = Boleto.find(params[:id])
---
SELECT  "boletos".* FROM "boletos" WHERE "boletos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]