app/controllers/encomendas_controller.rb

SELECT "encomendas".* FROM "encomendas"
SELECT "apartamentos".* FROM "apartamentos"
---
  def index
    @encomendas = Encomenda.all
    @apartamento = Apartamento.all

SELECT "apartamentos".* FROM "apartamentos"
---
  def new
    @encomenda = Encomenda.new
    @apartamento = Apartamento.all

SELECT "apartamentos".* FROM "apartamentos"
---
  def edit
    @apartamento = Apartamento.all

INSERT INTO "encomendas" ("tipo", "destinatario", "remetente", "data_chegada", "apartamento_id", "obs", "created_at", "updated_at", "entregue", "data_recebimento") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @encomenda = Encomenda.new(encomenda_params)

    respond_to do |format|
      if @encomenda.save

UPDATE "encomendas" SET "entregue" = ?, "data_recebimento" = ?, "updated_at" = ? WHERE "encomendas"."id" = ?  [["entregue", true], ["data_recebimento", Sat, 04 Mar 2017], ["updated_at", 2017-03-01 21:21:21 UTC], ["id", 7]]
---
  def update
    respond_to do |format|
      if @encomenda.update(encomenda_params)

DELETE FROM "encomendas" WHERE "encomendas"."id" = ?  [["id", 4]]
---
  def destroy
    @encomenda.destroy

SELECT  "encomendas".* FROM "encomendas" WHERE "encomendas"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_encomenda
      @encomenda = Encomenda.find(params[:id])