app/controllers/vagas_controller.rb

SELECT "vagas".* FROM "vagas"
SELECT "apartamentos".* FROM "apartamentos"
---
  def index
    @vagas = Vaga.all
    @apartamento = Apartamento.all

SELECT "apartamentos".* FROM "apartamentos"
---
  def new
    @vaga = Vaga.new
    @apartamento = Apartamento.all

SELECT "apartamentos".* FROM "apartamentos"
---
  def edit
    @apartamento = Apartamento.all

INSERT INTO "vagas" ("local", "modelo_carro", "cor_carro", "placa_carro", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["local", "G3 56"], ["modelo_carro", "VW up! move"], ["cor_carro", "Prata Egito"], ["placa_carro", "RTY - 9834"], ["created_at", 2017-02-25 06:04:40 UTC], ["updated_at", 2017-02-25 06:04:40 UTC]]
---
  def create
    @vaga = Vaga.new(vaga_params)

    respond_to do |format|
      if @vaga.save

UPDATE "vagas" SET "placa_carro" = ?, "updated_at" = ? WHERE "vagas"."id" = ?  [["placa_carro", "QQQ-0000"], ["updated_at", 2017-03-08 17:06:06 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @vaga.update(vaga_params)

DELETE FROM "vagas" WHERE "vagas"."id" = ?  [["id", 1]]
---
  def destroy
    @vaga.destroy

SELECT  "vagas".* FROM "vagas" WHERE "vagas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_vaga
      @vaga = Vaga.find(params[:id])