app/views/boletos/index.html.erb

      <tr>
       <% if (current_user.apt_login_id == nil) or (Apartamento.find(current_user.apt_login_id).local == boleto.apartamento.local)%>
---
SELECT  "apartamentos".* FROM "apartamentos" WHERE "apartamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]