app/views/encomendas/_form.html.erb

    <div class="col-lg-10">
      <%= f.select :apartamento_id, options_for_select(@apartamento.map{ |c| [c.local, c.id, {'local'=>c.local}] }, apartamento_id = f.object.apartamento_id) %>
---
SELECT "apartamentos".* FROM "apartamentos"