app/views/encomendas/index.html.erb

      <tr>
        <% if (Apartamento.find(current_user.apt_login_id).local == encomenda.apartamento.local) or (current_user.apt_login_id == nil)%>
---
SELECT  "apartamentos".* FROM "apartamentos" WHERE "apartamentos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]